pundit/restaurants_with_pundit/app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @restaurants = Restaurant.all

INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Le Wagon Lisboa"], ["user_id", 1], ["created_at", 2016-08-15 08:05:09 UTC], ["updated_at", 2016-08-15 08:05:09 UTC]]
---
  def create
    @restaurant = current_user.restaurants.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "Le Wagon Lisboa edited"], ["updated_at", 2016-08-15 08:37:50 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)

DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 3]]
---
  def destroy
    @restaurant.destroy